### Load the extension

In [12]:
%load_ext sql

### Connect to the database

In [13]:
%sql sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db

### Get list of tables

In [44]:
%%sql
SELECT *
FROM sqlite_master
WHERE type='table'
ORDER BY name;

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[('table', 'crime_scene_report', 'crime_scene_report', 2, 'CREATE TABLE crime_scene_report (\n        date integer,\n        type text,\n        description text,\n        city text\n    )'),
 ('table', 'datos_personales_tbl', 'datos_personales_tbl', 734, 'CREATE TABLE datos_personales_tbl(\n  name TEXT,\n  age INT,\n  gender TEXT,\n  height INT,\n  eye_color TEXT,\n  hair_color TEXT\n)'),
 ('table', 'drivers_license', 'drivers_license', 3, 'CREATE TABLE drivers_license (\n        id integer PRIMARY KEY,\n        age integer,\n        height integer,\n        eye_color text,\n        hair_color text,\n        gender text,\n        plate_number text,\n        car_make text,\n        car_model text\n    )'),
 ('table', 'facebook_event_checkin', 'facebook_event_checkin', 5, 'CREATE TABLE facebook_event_checkin (\n        person_id integer,\n        event_id integer,\n        event_name text,\n        date integer,\n        FOREIGN KEY (person_id) REFERENCES person(id)\n    )'),
 ('table', 'get_fit_now_check_in', 'get_fit_now_check_in', 9, 'CREATE TABLE get_fit_now_check_in (\n        membership_id text,\n        check_in_date integer,\n        check_in_time integer,\n        check_out_time integer,\n        FOREIGN KEY (membership_id) REFERENCES get_fit_now_member(id)\n    )'),
 ('table', 'get_fit_now_member', 'get_fit_now_member', 7, 'CREATE TABLE get_fit_now_member (\n        id text PRIMARY KEY,\n        person_id integer,\n        name text,\n        membership_start_date integer,\n        membership_status text,\n        FOREIGN KEY (person_id) REFERENCES person(id)\n    )'),
 ('table', 'income', 'income', 10, 'CREATE TABLE income (\n        ssn integer PRIMARY KEY,\n        annual_income integer\n    )'),
 ('table', 'interview', 'interview', 6, 'CREATE TABLE interview (\n        person_id integer,\n        transcript text,\n        FOREIGN KEY (person_id) REFERENCES person(id)\n    )'),
 ('table', 'person', 'person', 4, 'CREATE TABLE person (\n        id integer PRIMARY KEY,\n        name text,\n        license_id integer,\n        address_number integer,\n        address_street_name text,\n        ssn integer,\n        FOREIGN KEY (license_id) REFERENCES drivers_license(id)\n    )'),
 ('table', 'solution', 'solution', 11, 'CREATE TABLE solution (\n        user integer,\n        value text\n    )')]

![Schema](./images/schema_mystery.png)

In [15]:
%%sql
select *
from person
limit 5

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[(10000, 'Christoper Peteuil', 993845, 624, 'Bankhall Ave', 747714076),
 (10007, 'Kourtney Calderwood', 861794, 2791, 'Gustavus Blvd', 477972044),
 (10010, 'Muoi Cary', 385336, 741, 'Northwestern Dr', 828638512),
 (10016, 'Era Moselle', 431897, 1987, 'Wood Glade St', 614621061),
 (10025, 'Trena Hornby', 550890, 276, 'Daws Hill Way', 223877684)]

# Python DBAPI

In [1]:
import sqlite3

In [5]:
db_file = '/home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db'

In [6]:
conn = sqlite3.connect(db_file)

In [7]:
cur = conn.cursor()

In [8]:
query = 'select * from person'

In [9]:
cur.execute(query)

In [10]:
results = cur.fetchall()

In [18]:
import pandas as pd

In [20]:
person = pd.DataFrame(results, columns=['id','name', 'license_id', 'address_number','address_street_name', 'ssn'])

In [21]:
person.head()

,id,name,license_id,address_number,address_street_name,ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684

# DDL

In [35]:
%%sql
create view datos_personales as
select name, age, gender, height, eye_color, hair_color
from person p inner join drivers_license l on p.license_id = l.id

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[]

In [36]:
%%sql
select * from datos_personales limit 5

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[('Christoper Peteuil', 46, 'male', 59, 'black', 'green'),
 ('Kourtney Calderwood', 54, 'female', 74, 'black', 'white'),
 ('Muoi Cary', 24, 'female', 79, 'blue', 'green'),
 ('Era Moselle', 22, 'female', 75, 'amber', 'red'),
 ('Trena Hornby', 45, 'female', 60, 'blue', 'black')]

In [32]:
%%sql
select * 
from datos_personales inner join person on person.name = datos_personales.name 
limit 5

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[('Christoper Peteuil', 46, 'male', 59, 'black', 'green', 10000, 'Christoper Peteuil', 993845, 624, 'Bankhall Ave', 747714076),
 ('Kourtney Calderwood', 54, 'female', 74, 'black', 'white', 10007, 'Kourtney Calderwood', 861794, 2791, 'Gustavus Blvd', 477972044),
 ('Muoi Cary', 24, 'female', 79, 'blue', 'green', 10010, 'Muoi Cary', 385336, 741, 'Northwestern Dr', 828638512),
 ('Era Moselle', 22, 'female', 75, 'amber', 'red', 10016, 'Era Moselle', 431897, 1987, 'Wood Glade St', 614621061),
 ('Trena Hornby', 45, 'female', 60, 'blue', 'black', 10025, 'Trena Hornby', 550890, 276, 'Daws Hill Way', 223877684)]

In [33]:
%%sql
drop view datos_personales

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[]

In [37]:
%%sql
create table datos_personales_tbl as
select name, age, gender, height, eye_color, hair_color
from person p inner join drivers_license l on p.license_id = l.id

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[]

In [38]:
%%sql
select * from datos_personales_tbl limit 5

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[('Christoper Peteuil', 46, 'male', 59, 'black', 'green'),
 ('Kourtney Calderwood', 54, 'female', 74, 'black', 'white'),
 ('Muoi Cary', 24, 'female', 79, 'blue', 'green'),
 ('Era Moselle', 22, 'female', 75, 'amber', 'red'),
 ('Trena Hornby', 45, 'female', 60, 'blue', 'black')]

In [39]:
%%sql
select * from drivers_license limit 3

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[(100280, 72, 57, 'brown', 'red', 'male', 'P24L4U', 'Acura', 'MDX'),
 (100460, 63, 72, 'brown', 'brown', 'female', 'XF02T6', 'Cadillac', 'SRX'),
 (101029, 62, 74, 'green', 'green', 'female', 'VKY5KR', 'Scion', 'xB')]

In [ ]:
%%sql
CREATE TABLE drivers_license (
    id integer PRIMARY KEY,
    age integer,
    height integer,
    eye_color text,
    hair_color text,
    gender text,
    plate_number text,
    car_make text,
    car_model text
)

In [45]:
%%sql
select * from person limit 3

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[(10000, 'Christoper Peteuil', 993845, 624, 'Bankhall Ave', 747714076),
 (10007, 'Kourtney Calderwood', 861794, 2791, 'Gustavus Blvd', 477972044),
 (10010, 'Muoi Cary', 385336, 741, 'Northwestern Dr', 828638512)]

In [63]:
%%sql
DROP TABLE persona;

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[]

In [64]:
%%sql
CREATE TABLE persona (
    id integer PRIMARY KEY,
    name text,
    age integer NOT NULL,
    gender text DEFAULT 'Female',
    address text,
    ssn integer
)

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[]

In [50]:
%%sql
ALTER TABLE persona ADD COLUMN gender text;

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[]

In [77]:
%%sql
insert into persona (id, name, age) values (2,'Beatriz',35), (3,'Yulia',40)

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
2 rows affected.

[]

In [73]:
%%sql
update persona set address = 'Monistrol 16', ssn = 8798978978 where id = 1

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
1 rows affected.

[]

In [75]:
%%sql
update persona set gender = 'Male' where id = 1

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
1 rows affected.

[]

In [81]:
%%sql
delete from persona

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
2 rows affected.

[]

In [86]:
%%sql
select *
from persona
limit 10

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[(10000, 'Christoper Peteuil', 46, 'male', '624 Bankhall Ave', 747714076),
 (10007, 'Kourtney Calderwood', 54, 'female', '2791 Gustavus Blvd', 477972044),
 (10010, 'Muoi Cary', 24, 'female', '741 Northwestern Dr', 828638512),
 (10016, 'Era Moselle', 22, 'female', '1987 Wood Glade St', 614621061),
 (10025, 'Trena Hornby', 45, 'female', '276 Daws Hill Way', 223877684),
 (10027, 'Antione Godbolt', 56, 'male', '2431 Zelham Dr', 491650087),
 (10034, 'Kyra Buen', 56, 'female', '1873 Sleigh Dr', 332497972),
 (10039, 'Francesco Agundez', 87, 'male', '736 Buswell Dr', 861079251),
 (10095, 'Leslie Thate', 83, 'female', '2772 Camellia Park Circle', 127944356),
 (10122, 'Alva Conkel', 52, 'male', '116 Diversey Circle', 148521773)]

In [ ]:
%%sql
insert into persona
select p.id, p.name, l.age, l.gender, p.address_number || ' ' || p.address_street_name, p.ssn
from person p join drivers_license l on l.id = p.license_id

In [87]:
%%sql
alter table drivers_license add column person_id

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[]

In [91]:
%%sql
select * from drivers_license limit 5

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[(100280, 72, 57, 'brown', 'red', 'male', 'P24L4U', 'Acura', 'MDX', 22757),
 (100460, 63, 72, 'brown', 'brown', 'female', 'XF02T6', 'Cadillac', 'SRX', 84910),
 (101029, 62, 74, 'green', 'green', 'female', 'VKY5KR', 'Scion', 'xB', 84921),
 (101198, 43, 54, 'amber', 'brown', 'female', 'Y5NZ08', 'Nissan', 'Rogue', 58014),
 (101255, 18, 79, 'blue', 'grey', 'female', '5162Z1', 'Lexus', 'GS', 90704)]

In [90]:
%%sql
update drivers_license 
set person_id = (select person.id from person where license_id = drivers_license.id)

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
10007 rows affected.

[]

In [93]:
%%sql
select * from person where id = 22757

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[(22757, 'Alfonzo Lighter', 100280, 2380, 'Demeo Rd', 158688705)]

In [94]:
import pandas as pd

In [95]:
pd.read_sql('select * from persona', db_url)

          id                 name  age  gender              address        ssn
0      10000   Christoper Peteuil   46    male     624 Bankhall Ave  747714076
1      10007  Kourtney Calderwood   54  female   2791 Gustavus Blvd  477972044
2      10010            Muoi Cary   24  female  741 Northwestern Dr  828638512
3      10016          Era Moselle   22  female   1987 Wood Glade St  614621061
4      10025         Trena Hornby   45  female    276 Daws Hill Way  223877684
...      ...                  ...  ...     ...                  ...        ...
10001  99936          Luba Benser   26  female     680 Carnage Blvd  685095054
10002  99941      Roxana Mckimley   87  female         1613 Gate St  512136801
10003  99965      Cherie Zeimantz   29  female   3661 The Water Ave  362877324
10004  99982          Allen Cruse   66    male       3126 N Jean Dr  348734531
10005  99990         Vance Hunten   61    male   3056 Lancefield St  896677562

[10006 rows x 6 columns]

In [100]:
%%sql
select * from drivers_license limit 5 offset 15

 * sqlite:////home/bioinformatica/Ironhack/3_Code/notebooks/data/sql-murder-mystery.db
Done.

[(101859, 31, 71, 'blue', 'blonde', 'female', '02B7L4', 'Nissan', 'Pathfinder', 72104),
 (101862, 26, 75, 'green', 'blonde', 'male', 'LQ23Y5', 'Nissan', '350Z', 44563),
 (101909, 84, 52, 'amber', 'brown', 'male', '5Y633C', 'Ford', 'E-Series', 94087),
 (102089, 75, 52, 'blue', 'blonde', 'female', '2QL48Q', 'GMC', 'Savana 3500', 28173),
 (102182, 66, 63, 'green', 'white', 'male', 'JI6481', 'Saturn', 'S-Series', 54997)]